cases/flameletBuoyantPimpleSMOKE/Sandia_COH2N2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 101325;

boundaryField
{
    inletfuel           
    {
        type           calculated;
        value          $internalField;
    }
    inletair           
    {
        type           calculated;
        value          $internalField;
    }
    outlet
    {
        type           calculated;
        value          $internalField;
    }
    sidewall
    {
        type           calculated;
        value          $internalField;
    }
    burnerwall       
    {
        type           calculated;
        value          $internalField;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
