cases/flameletBuoyantPimpleSMOKE/Sandia_COH2N2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       flameletBouyantPimpleSMOKE;

startFrom         latestTime;

startTime         0;

stopAt            noWriteNow;

endTime           1.00;

deltaT            1e-7;

writeControl      adjustableRunTime;

writeInterval     25e-3;

purgeWrite        0;

writeFormat       ascii;

writePrecision    9;

writeCompression  uncompressed;

timeFormat        general;

timePrecision     6;

runTimeModifiable yes;

adjustTimeStep    yes;

maxCo             0.5;

maxDeltaT         1e-4;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
